app/controllers/events_controller.rb

SELECT title,start,categories.color FROM "events" INNER JOIN "categories" ON "categories"."id" = "events"."category_id" WHERE "events"."user_id" = 1
---
  def index
    @events = Event.where(:user_id => current_user.id).joins(:category).select("title,start,categories.color")

INSERT INTO "events" ("category_id", "created_at", "date_on", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    date = params[:event][:start].split("/")  unless params[:event][:start].blank?
    params[:event][:start] = date.insert(1,date.delete_at(0)).join("-").to_date.strftime("%Y-%m-%d") unless params[:event][:start].blank?

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "events" SET "user_id" = 1, "updated_at" = '2014-08-30 14:23:33.673932' WHERE "events"."id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event].merge({:user_id => current_user.id}))